# Riassunto Capitolo 6 - Data Loading, Storage, and file formats

Pandas mette a disposizione dei metodi per la lettura dei dati attraverso varie tipologie di files, le pi√π comuni **read_csv** oppure **read_table**.

Le opzioni che si possono dare a queste funzioni di lettura su file sono molteplici, ma si possono riassumere in alcune categorie:
    
    - indicizzazione
    - data conversion
    - datetime parsing
    - iterazione sui dati
    - pulizia degli errori sui dati

### Esempi

In [3]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
import pandas as pd
import numpy as np
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
df = pd.read_csv('ex1.csv', sep=',')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
df = pd.read_csv('ex2.csv', header=None)

In [11]:
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
df = pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

In [13]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
names = ['a', 'b', 'c', 'd', 'message']
df = pd.read_csv('ex2.csv', names=names, index_col='message')

In [16]:
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [20]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

In [21]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [23]:
result = pd.read_table('ex3.txt', sep='\s+') # con una espressione regolare

In [24]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [25]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [26]:
es = pd.read_csv('ex4.csv', skiprows=[0,2,3])

In [27]:
es

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [29]:
ris = pd.read_csv('ex5.csv')

In [30]:
ris

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
isnull = pd.isnull(ris)

In [33]:
isnull

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [34]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [35]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
sentinels

{'message': ['foo', 'NA'], 'something': ['two']}

In [37]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Processamento di grandi mole di dati

Quando processiamo grandissime mole di dati in realt√† a noi interessa leggere una piccola porzione di dati oppure iterare su di essa.

Possiamo dire prima di tutto a Pandas di darci una visualizzazione un p√≤ pi√π compatta

In [38]:
pd.options.display.max_rows = 10

In [39]:
result = pd.read_csv('ex6.csv')

In [40]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [41]:
# se vogliamo leggere un piccolo estratto di 5 righe, invece di leggere l'intero file
result = pd.read_csv('ex6.csv', nrows=5)

In [42]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [43]:
# leggere un file in pezzi - chunks
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [44]:
chunker

In [47]:
# TODO: questo esempio non l'ho capito
tot = pd.Series([])
tot.dtype
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

<ipython-input-47-4c9c6d5f7753>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

### Scrivere dati in formato testuale

In [49]:
data = pd.read_csv('ex5.csv')

In [50]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
data.to_csv('out.csv')

In [52]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [53]:
# possiamo usare i delimitatori di testo
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [54]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [55]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [56]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [57]:
dates = pd.date_range('1/1/2000', periods=7)

In [58]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [59]:
ts = pd.Series(np.arange(7), index=dates)

In [60]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [62]:
ts.to_csv('tseries.csv')

In [63]:
!type tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Lavorare con i formati delimitati

Si possono caricare molte forme di dati tabellari sfruttando la funzione Pandas **read_table**, ma in alcuni casi sono necessarie delle procedure manuali, ad esempio nel caso
il file contenga dei dati malformati, che possono mandare in fumo il processing del metodo read_table.

In [64]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [74]:
# possiamo usare la funzione built-in di Python CSV
import csv
f = open('ex7.csv')
reader = csv.reader(f)

In [75]:
reader

In [76]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [77]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [78]:
header, values = lines[0], lines[1:]

In [79]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [80]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [95]:
import csv
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [96]:
my_dialect

__main__.my_dialect

In [97]:
type(my_dialect)

type

In [98]:
my_dialect.delimiter

';'

In [99]:
reader

In [100]:
f = open('ex7.csv')
reader = csv.reader(f, delimiter='|')

In [101]:
reader

In [102]:
reader = csv.reader(f, dialect=my_dialect)

In [103]:
print(reader)

<_csv.reader object at 0x0000025720421C40>

In [104]:
reader.dialect

In [105]:
with open('mydata_with_my_dialect.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### JSON Data

Diffusissimo formato standard per l'interscambio dei dati attraverso il protocollo HTTP.

In [106]:
# esempio di JSON
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [107]:
obj

'\n{"name": "Wes",\n"places_lived": ["United States", "Spain", "Germany"],\n"pet": null,\n"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n{"name": "Katie", "age": 38,\n"pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [109]:
# possiamo servirci del modulo built-in json per trasformare il nostro json stringa in un oggetto Python json
import json
result = json.loads(obj)

In [110]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [111]:
# possiamo convertire un oggetto Python json in un json direttamente con dumps
asjson = json.dumps(result)

In [112]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [113]:
# per convertire un json in un dataframe Pandas, dobbiamo dare una sistemata ai dati prima di tutto
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [114]:
siblings

    name  age
0  Scott   30
1  Katie   38

#### Il metodo read_json di Pandas

Converte automaticamente un json datasets in serie e dataframes.

In [115]:
!type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [116]:
data_from_json_to_pandas = pd.read_json('example.json')

In [117]:
data_from_json_to_pandas

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [118]:
data_from_pandas_to_json = data_from_json_to_pandas.to_json()

In [119]:
print(data_from_pandas_to_json)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

### XML e HTML: il web Scraping

Python si serve di tantissime librerie per la lettura di dati HTML e XML, una ad esempio √® **lxml**, oppure **Beautiful Soup** o **html5lib**.

Pandas in realt√† contiene gi√† una funzione per leggere l'html che si chiama **read_html** e che si serve di Lxml e Beatiful Soup per parsare i dati in dataframes. 
Vediamone alcuni esempi di uso.

In [120]:
# uso di read_html
tables = pd.read_html('fdic_failed_bank_list.html')

In [121]:
# lunghezza
len(tables)

1

In [122]:
failures = tables[0]

In [123]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [124]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [125]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [126]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Parsing di XML

In [135]:
from lxml import objectify

In [136]:
path = 'performance.xml'

In [137]:
parsed_xml_file = objectify.parse(open(path))

In [138]:
parsed_xml_file

In [144]:
root = parsed_xml_file.getroot()

In [145]:
root

In [149]:
data = []
root.getchildren()

[373889,
 '',
 'Metro-North Railroad',
 'Escalator Availability',
 'Percent of the time that escalators are operational\nsystemwide. The availability rate is based on physical observations performed\nthe morning of regular business days only. This is a new indicator the agency\nbegan reporting in 2009.',
 2011,
 12,
 'Service Indicators',
 'M',
 'U',
 '%',
 1,
 97.0,
 '',
 97.0,
 '']

### Dati in formato Binario

Gli oggetti Pandas sono in grado di gestire il metodo **pickle** nativo di Python per lo storing di dati in formato binario.

In [152]:
frame = pd.read_csv('ex1.csv')

In [153]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [154]:
frame.to_pickle('frame_pickle')

In [155]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Vantaggi**: formato dati molto piccolo
    
**Svantaggi**: stabilit√† nel tempo

√® molto meglio usare il formato **HDF5**, dobbiamo per√≤ ricordarci di installere prima il modulo **tables**, quindi **pip install tables**

In [159]:
# √® molto meglio usare il formato HDF5 
frame = pd.DataFrame({'a': np.random.randn(100)})

In [160]:
store = pd.HDFStore('my_data_in_HDF5.h5')

In [162]:
store['obj1'] = frame
store['obj1_col'] = frame['a']

In [163]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: my_data_in_HDF5.h5

In [164]:
store['obj1']

           a
0  -1.545574
1   0.643328
2   0.204825
3  -0.368079
4  -2.015145
..       ...
95 -0.340825
96  1.237037
97 -0.113831
98 -0.748444
99 -0.950036

[100 rows x 1 columns]

In [165]:
store.put('obj2', frame, format='table')

In [166]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.530446
11  0.483267
12 -0.426158
13  0.908982
14  0.297381
15 -0.340077

In [167]:
store.close()

In [172]:
frame.to_hdf('my_data_in_HDF5.h5', 'obj3', format='table')

### Leggere file Excel

In [183]:
import xlrd
xlsx = pd.ExcelFile('ex1.xlsx')

**Importante**: **pip install xlrd** per l'Excel_Reader altrimenti non funziona, bisogna importare il modulo per supportare l'engine Excel e anche **pip install openpyxl** per il Excel_Writer

In [184]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [185]:
frame = pd.read_excel('ex1.xlsx', 'Sheet1')

In [186]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [194]:
writer = pd.ExcelWriter('mioExcel.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [195]:
frame.to_excel('mioExcel.xlsx')

### Interazione via Web Api

In [199]:
import  requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [200]:
data = resp.json()

In [204]:
data[0]['title']

'ENH: Functions for creating data frames and series "like" an existing one with different values'

### Interazione con i Database

In [205]:
import sqlite3
query = """
CREATE TABLE test (a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER);
"""
print(query)

CREATE TABLE test (a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER);

In [206]:
connection = sqlite3.connect('mydata.sqlite')

In [208]:
connection.execute(query)

In [209]:
connection.commit()

In [213]:
data_to_insert = [
    ('Atlanta', 'Georgia', 1.25, 6),
    ('Tallahasse', 'Florida', 2.6, 3),
    ('Sacramento', 'California', 1.7, 5),
    ('Tampa', 'Florida', 2., 8)
]

In [214]:
statement = "INSERT INTO test VALUES(?,?,?,?)"
connection.executemany(statement, data_to_insert)

In [215]:
connection.commit()

In [216]:
cursor = connection.execute('select * from test')

In [217]:
rows = cursor.fetchall()

In [218]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Tampa', 'Florida', 2.0, 8),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Tampa', 'Florida', 2.0, 8)]

In [219]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [221]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5
3       Tampa     Florida  2.00  8
4     Atlanta     Georgia  1.25  6
5  Tallahasse     Florida  2.60  3
6  Sacramento  California  1.70  5
7       Tampa     Florida  2.00  8

In [222]:
print(rows[1])

('Tallahasse', 'Florida', 2.6, 3)

In [224]:
for val in rows:
    print(val[0])

Atlanta
Tallahasse
Sacramento
Tampa
Atlanta
Tallahasse
Sacramento
Tampa